app/Models/Datamodel.php

SELECT *
FROM `mahasiswa`
---
        function getData()
        {
            return $this->db->table("mahasiswa")->get();

SELECT *
FROM `penjualan`.`barang`
---
        function getDataBarang()
        {
            return $this->db->table("penjualan.barang")->get();